# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
dictionery = {
    'name' : ['Mabtoor', 'Waqas', 'Horair', 'Waheed','Umer','Atif','Zeeshan','Zaka','Taqveem','Snawra'],
    'RollNo' : [235,753,673,732,796,357,853,257,975,465],
    'CTC' : [34,24,75,34,65,45,65,74,63,35],
    'PTR' : [542,564,435,756,445,665,334,653,563,134],
    'RTC' : [545,412,531,653,234,152,632,645,765,523],
    'UFN' : [432,235,653,123,455,632,424,635,673,154]
}

In [3]:
dictionery

{'name': ['Mabtoor',
  'Waqas',
  'Horair',
  'Waheed',
  'Umer',
  'Atif',
  'Zeeshan',
  'Zaka',
  'Taqveem',
  'Snawra'],
 'RollNo': [235, 753, 673, 732, 796, 357, 853, 257, 975, 465],
 'CTC': [34, 24, 75, 34, 65, 45, 65, 74, 63, 35],
 'PTR': [542, 564, 435, 756, 445, 665, 334, 653, 563, 134],
 'RTC': [545, 412, 531, 653, 234, 152, 632, 645, 765, 523],
 'UFN': [432, 235, 653, 123, 455, 632, 424, 635, 673, 154]}

In [4]:
df = pd.DataFrame(dictionery)

In [5]:
df

      name  RollNo  CTC  PTR  RTC  UFN
0  Mabtoor     235   34  542  545  432
1    Waqas     753   24  564  412  235
2   Horair     673   75  435  531  653
3   Waheed     732   34  756  653  123
4     Umer     796   65  445  234  455
5     Atif     357   45  665  152  632
6  Zeeshan     853   65  334  632  424
7     Zaka     257   74  653  645  635
8  Taqveem     975   63  563  765  673
9   Snawra     465   35  134  523  154

In [6]:
df.head(2)

      name  RollNo  CTC  PTR  RTC  UFN
0  Mabtoor     235   34  542  545  432
1    Waqas     753   24  564  412  235

In [7]:
df.tail(2)

      name  RollNo  CTC  PTR  RTC  UFN
8  Taqveem     975   63  563  765  673
9   Snawra     465   35  134  523  154

In [8]:
df.describe()

           RollNo        CTC         PTR         RTC         UFN
count   10.000000  10.000000   10.000000   10.000000   10.000000
mean   609.600000  51.400000  509.100000  509.200000  441.600000
std    261.711971  18.968981  180.718596  192.744967  210.654114
min    235.000000  24.000000  134.000000  152.000000  123.000000
25%    384.000000  34.250000  437.500000  439.750000  282.250000
50%    702.500000  54.000000  552.500000  538.000000  443.500000
75%    785.250000  65.000000  630.750000  641.750000  634.250000
max    975.000000  75.000000  756.000000  765.000000  673.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   RollNo  10 non-null     int64
 2   CTC     10 non-null     int64
 3   PTR     10 non-null     int64
 4   RTC     10 non-null     int64
 5   UFN     10 non-null     int64
dtypes: int64(5), object(1)
memory usage: 608.0+ bytes

In [10]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [11]:
df.columns

Index(['name', 'RollNo', 'CTC', 'PTR', 'RTC', 'UFN'], dtype='object')

In [12]:
df['name']

0    Mabtoor
1      Waqas
2     Horair
3     Waheed
4       Umer
5       Atif
6    Zeeshan
7       Zaka
8    Taqveem
9     Snawra
Name: name, dtype: object

In [13]:
df['name'][0]

'Mabtoor'

In [14]:
df['name'][0]='Mabx'

<ipython-input-14-33214cfdbd30>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][0]='Mabx'

In [15]:
df

      name  RollNo  CTC  PTR  RTC  UFN
0     Mabx     235   34  542  545  432
1    Waqas     753   24  564  412  235
2   Horair     673   75  435  531  653
3   Waheed     732   34  756  653  123
4     Umer     796   65  445  234  455
5     Atif     357   45  665  152  632
6  Zeeshan     853   65  334  632  424
7     Zaka     257   74  653  645  635
8  Taqveem     975   63  563  765  673
9   Snawra     465   35  134  523  154

In [16]:
df['name'][0] = 'Mabtoor'

<ipython-input-16-a47960d2b0a8>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][0] = 'Mabtoor'

In [17]:
df

      name  RollNo  CTC  PTR  RTC  UFN
0  Mabtoor     235   34  542  545  432
1    Waqas     753   24  564  412  235
2   Horair     673   75  435  531  653
3   Waheed     732   34  756  653  123
4     Umer     796   65  445  234  455
5     Atif     357   45  665  152  632
6  Zeeshan     853   65  334  632  424
7     Zaka     257   74  653  645  635
8  Taqveem     975   63  563  765  673
9   Snawra     465   35  134  523  154

In [18]:
df.head()

      name  RollNo  CTC  PTR  RTC  UFN
0  Mabtoor     235   34  542  545  432
1    Waqas     753   24  564  412  235
2   Horair     673   75  435  531  653
3   Waheed     732   34  756  653  123
4     Umer     796   65  445  234  455

In [22]:
df.to_csv('infor.csv')

In [23]:
pd.read_csv('infor.csv')

   Unnamed: 0     name  RollNo  CTC  PTR  RTC  UFN
0           0  Mabtoor     235   34  542  545  432
1           1    Waqas     753   24  564  412  235
2           2   Horair     673   75  435  531  653
3           3   Waheed     732   34  756  653  123
4           4     Umer     796   65  445  234  455
5           5     Atif     357   45  665  152  632
6           6  Zeeshan     853   65  334  632  424
7           7     Zaka     257   74  653  645  635
8           8  Taqveem     975   63  563  765  673
9           9   Snawra     465   35  134  523  154

In [24]:
df.to_csv('infor_without_indices', index=False)

In [26]:
pd.read_csv('infor_without_indices')

      name  RollNo  CTC  PTR  RTC  UFN
0  Mabtoor     235   34  542  545  432
1    Waqas     753   24  564  412  235
2   Horair     673   75  435  531  653
3   Waheed     732   34  756  653  123
4     Umer     796   65  445  234  455
5     Atif     357   45  665  152  632
6  Zeeshan     853   65  334  632  424
7     Zaka     257   74  653  645  635
8  Taqveem     975   63  563  765  673
9   Snawra     465   35  134  523  154

In [27]:
df.to_excel('infor.xlsx')

In [28]:
df.to_excel('infor_without_indices.xlsx', index=False)

In [29]:
df.to_csv('infor.txt')

In [30]:
df.to_csv('infor_without_indices.txt', index= False)

In [32]:
pd.read_excel('infor.xlsx')

   Unnamed: 0     name  RollNo  CTC  PTR  RTC  UFN
0           0  Mabtoor     235   34  542  545  432
1           1    Waqas     753   24  564  412  235
2           2   Horair     673   75  435  531  653
3           3   Waheed     732   34  756  653  123
4           4     Umer     796   65  445  234  455
5           5     Atif     357   45  665  152  632
6           6  Zeeshan     853   65  334  632  424
7           7     Zaka     257   74  653  645  635
8           8  Taqveem     975   63  563  765  673
9           9   Snawra     465   35  134  523  154

In [34]:
pd.read_excel('infor_without_indices.xlsx')

      name  RollNo  CTC  PTR  RTC  UFN
0  Mabtoor     235   34  542  545  432
1    Waqas     753   24  564  412  235
2   Horair     673   75  435  531  653
3   Waheed     732   34  756  653  123
4     Umer     796   65  445  234  455
5     Atif     357   45  665  152  632
6  Zeeshan     853   65  334  632  424
7     Zaka     257   74  653  645  635
8  Taqveem     975   63  563  765  673
9   Snawra     465   35  134  523  154

In [35]:
pd.read_csv('infor.txt')

   Unnamed: 0     name  RollNo  CTC  PTR  RTC  UFN
0           0  Mabtoor     235   34  542  545  432
1           1    Waqas     753   24  564  412  235
2           2   Horair     673   75  435  531  653
3           3   Waheed     732   34  756  653  123
4           4     Umer     796   65  445  234  455
5           5     Atif     357   45  665  152  632
6           6  Zeeshan     853   65  334  632  424
7           7     Zaka     257   74  653  645  635
8           8  Taqveem     975   63  563  765  673
9           9   Snawra     465   35  134  523  154

In [36]:
pd.read_csv('infor_without_indices.txt')

      name  RollNo  CTC  PTR  RTC  UFN
0  Mabtoor     235   34  542  545  432
1    Waqas     753   24  564  412  235
2   Horair     673   75  435  531  653
3   Waheed     732   34  756  653  123
4     Umer     796   65  445  234  455
5     Atif     357   45  665  152  632
6  Zeeshan     853   65  334  632  424
7     Zaka     257   74  653  645  635
8  Taqveem     975   63  563  765  673
9   Snawra     465   35  134  523  154

In [37]:
ser = pd.Series((2,4))

In [38]:
ser

0    2
1    4
dtype: int64

In [39]:
type(ser)

pandas.core.series.Series

In [41]:
newdf =  pd.DataFrame(np.random.rand(333,4), index= np.arange(333))

In [42]:
newdf

            0         1         2         3
0    0.388905  0.413047  0.329586  0.619220
1    0.762780  0.927830  0.688114  0.798926
2    0.341790  0.665740  0.176250  0.737850
3    0.652155  0.157335  0.735315  0.421148
4    0.340311  0.460733  0.924275  0.825568
..        ...       ...       ...       ...
328  0.885090  0.804948  0.272622  0.811416
329  0.256955  0.541297  0.675290  0.457969
330  0.673282  0.321142  0.479422  0.086982
331  0.896167  0.904591  0.775824  0.619668
332  0.118536  0.804440  0.570352  0.866712

[333 rows x 4 columns]

In [43]:
type(newdf)

pandas.core.frame.DataFrame

In [44]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            323, 324, 325, 326, 327, 328, 329, 330, 331, 332],
           dtype='int64', length=333)

In [45]:
newdf.columns

RangeIndex(start=0, stop=4, step=1)

In [46]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,323,324,325,326,327,328,329,330,331,332
0,0.388905,0.762780,0.34179,0.652155,0.340311,0.939771,0.167431,0.821074,0.166660,0.570378,...,0.663194,0.046629,0.233375,0.958394,0.295155,0.885090,0.256955,0.673282,0.896167,0.118536
1,0.413047,0.927830,0.66574,0.157335,0.460733,0.252608,0.345559,0.873134,0.823791,0.199365,...,0.590784,0.746992,0.139814,0.248242,0.872624,0.804948,0.541297,0.321142,0.904591,0.804440
2,0.329586,0.688114,0.17625,0.735315,0.924275,0.585362,0.307033,0.259618,0.194326,0.153224,...,0.451264,0.546551,0.143305,0.505169,0.119043,0.272622,0.675290,0.479422,0.775824,0.570352
3,0.619220,0.798926,0.73785,0.421148,0.825568,0.032640,0.343259,0.558685,0.729528,0.958246,...,0.525113,0.721467,0.969735,0.692651,0.362528,0.811416,0.457969,0.086982,0.619668,0.866712

In [47]:
newdf.head(2)

          0         1         2         3
0  0.388905  0.413047  0.329586  0.619220
1  0.762780  0.927830  0.688114  0.798926

In [48]:
newdf.tail(2)

            0         1         2         3
331  0.896167  0.904591  0.775824  0.619668
332  0.118536  0.804440  0.570352  0.866712

In [49]:
newdf.describe()

                0           1           2           3
count  333.000000  333.000000  333.000000  333.000000
mean     0.533743    0.493906    0.489675    0.524925
std      0.293523    0.291121    0.283046    0.284313
min      0.000643    0.002018    0.002484    0.007838
25%      0.295155    0.242394    0.240186    0.301836
50%      0.535911    0.483403    0.485398    0.546635
75%      0.802677    0.765535    0.739669    0.743383
max      0.991219    0.998050    0.994183    0.999374

In [50]:
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3
0    0.388905  0.413047  0.329586  0.619220
1    0.762780  0.927830  0.688114  0.798926
2    0.341790  0.665740  0.176250  0.737850
3    0.652155  0.157335  0.735315  0.421148
4    0.340311  0.460733  0.924275  0.825568
..        ...       ...       ...       ...
328  0.885090  0.804948  0.272622  0.811416
329  0.256955  0.541297  0.675290  0.457969
330  0.673282  0.321142  0.479422  0.086982
331  0.896167  0.904591  0.775824  0.619668
332  0.118536  0.804440  0.570352  0.866712

[333 rows x 4 columns]>

In [53]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
dtype: object

In [54]:
newdf.shape

(333, 4)

In [59]:
newdf.info

<bound method DataFrame.info of             0         1         2         3
0    0.388905  0.413047  0.329586  0.619220
1    0.762780  0.927830  0.688114  0.798926
2    0.341790  0.665740  0.176250  0.737850
3    0.652155  0.157335  0.735315  0.421148
4    0.340311  0.460733  0.924275  0.825568
..        ...       ...       ...       ...
328  0.885090  0.804948  0.272622  0.811416
329  0.256955  0.541297  0.675290  0.457969
330  0.673282  0.321142  0.479422  0.086982
331  0.896167  0.904591  0.775824  0.619668
332  0.118536  0.804440  0.570352  0.866712

[333 rows x 4 columns]>

In [61]:
newdf.head(1)

          0         1         2        3
0  0.388905  0.413047  0.329586  0.61922

In [62]:
newdf.loc[0][0]  = 0.422313

In [63]:
newdf

            0         1         2         3
0    0.422313  0.413047  0.329586  0.619220
1    0.762780  0.927830  0.688114  0.798926
2    0.341790  0.665740  0.176250  0.737850
3    0.652155  0.157335  0.735315  0.421148
4    0.340311  0.460733  0.924275  0.825568
..        ...       ...       ...       ...
328  0.885090  0.804948  0.272622  0.811416
329  0.256955  0.541297  0.675290  0.457969
330  0.673282  0.321142  0.479422  0.086982
331  0.896167  0.904591  0.775824  0.619668
332  0.118536  0.804440  0.570352  0.866712

[333 rows x 4 columns]

In [65]:
newdf.copy(21)

            0         1         2         3
0    0.422313  0.413047  0.329586  0.619220
1    0.762780  0.927830  0.688114  0.798926
2    0.341790  0.665740  0.176250  0.737850
3    0.652155  0.157335  0.735315  0.421148
4    0.340311  0.460733  0.924275  0.825568
..        ...       ...       ...       ...
328  0.885090  0.804948  0.272622  0.811416
329  0.256955  0.541297  0.675290  0.457969
330  0.673282  0.321142  0.479422  0.086982
331  0.896167  0.904591  0.775824  0.619668
332  0.118536  0.804440  0.570352  0.866712

[333 rows x 4 columns]

In [66]:
newdf.head(21)

           0         1         2         3
0   0.422313  0.413047  0.329586  0.619220
1   0.762780  0.927830  0.688114  0.798926
2   0.341790  0.665740  0.176250  0.737850
3   0.652155  0.157335  0.735315  0.421148
4   0.340311  0.460733  0.924275  0.825568
5   0.939771  0.252608  0.585362  0.032640
6   0.167431  0.345559  0.307033  0.343259
7   0.821074  0.873134  0.259618  0.558685
8   0.166660  0.823791  0.194326  0.729528
9   0.570378  0.199365  0.153224  0.958246
10  0.991219  0.901647  0.757210  0.022702
11  0.297537  0.025783  0.648202  0.709001
12  0.374536  0.487781  0.775277  0.685880
13  0.586162  0.426245  0.682750  0.189007
14  0.569065  0.377377  0.558967  0.325128
15  0.181689  0.065817  0.800072  0.495971
16  0.396869  0.301879  0.474435  0.007838
17  0.206535  0.122202  0.964117  0.717388
18  0.554737  0.047097  0.264971  0.327910
19  0.424487  0.836189  0.490360  0.242076
20  0.477577  0.251216  0.258540  0.063419

In [67]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3
332  0.118536  0.804440  0.570352  0.866712
331  0.896167  0.904591  0.775824  0.619668
330  0.673282  0.321142  0.479422  0.086982
329  0.256955  0.541297  0.675290  0.457969
328  0.885090  0.804948  0.272622  0.811416
..        ...       ...       ...       ...
4    0.340311  0.460733  0.924275  0.825568
3    0.652155  0.157335  0.735315  0.421148
2    0.341790  0.665740  0.176250  0.737850
1    0.762780  0.927830  0.688114  0.798926
0    0.422313  0.413047  0.329586  0.619220

[333 rows x 4 columns]

In [68]:
newdf.sort_index(axis=1, ascending=False)

            3         2         1         0
0    0.619220  0.329586  0.413047  0.422313
1    0.798926  0.688114  0.927830  0.762780
2    0.737850  0.176250  0.665740  0.341790
3    0.421148  0.735315  0.157335  0.652155
4    0.825568  0.924275  0.460733  0.340311
..        ...       ...       ...       ...
328  0.811416  0.272622  0.804948  0.885090
329  0.457969  0.675290  0.541297  0.256955
330  0.086982  0.479422  0.321142  0.673282
331  0.619668  0.775824  0.904591  0.896167
332  0.866712  0.570352  0.804440  0.118536

[333 rows x 4 columns]

In [70]:
newdf.drop(0, axis=0)

            0         1         2         3
1    0.762780  0.927830  0.688114  0.798926
2    0.341790  0.665740  0.176250  0.737850
3    0.652155  0.157335  0.735315  0.421148
4    0.340311  0.460733  0.924275  0.825568
5    0.939771  0.252608  0.585362  0.032640
..        ...       ...       ...       ...
328  0.885090  0.804948  0.272622  0.811416
329  0.256955  0.541297  0.675290  0.457969
330  0.673282  0.321142  0.479422  0.086982
331  0.896167  0.904591  0.775824  0.619668
332  0.118536  0.804440  0.570352  0.866712

[332 rows x 4 columns]

In [71]:
newdf.head(1)

          0         1         2        3
0  0.422313  0.413047  0.329586  0.61922

In [72]:
newdf.drop(0,axis=1, inplace=True)

In [73]:
newdf

            1         2         3
0    0.413047  0.329586  0.619220
1    0.927830  0.688114  0.798926
2    0.665740  0.176250  0.737850
3    0.157335  0.735315  0.421148
4    0.460733  0.924275  0.825568
..        ...       ...       ...
328  0.804948  0.272622  0.811416
329  0.541297  0.675290  0.457969
330  0.321142  0.479422  0.086982
331  0.904591  0.775824  0.619668
332  0.804440  0.570352  0.866712

[333 rows x 3 columns]

In [74]:
newdf.loc[0][1]

0.4130473835372189

In [75]:
newdf.iloc[0,2]

0.6192197651617278

In [76]:
newdf.reset_index()

     index         1         2         3
0        0  0.413047  0.329586  0.619220
1        1  0.927830  0.688114  0.798926
2        2  0.665740  0.176250  0.737850
3        3  0.157335  0.735315  0.421148
4        4  0.460733  0.924275  0.825568
..     ...       ...       ...       ...
328    328  0.804948  0.272622  0.811416
329    329  0.541297  0.675290  0.457969
330    330  0.321142  0.479422  0.086982
331    331  0.904591  0.775824  0.619668
332    332  0.804440  0.570352  0.866712

[333 rows x 4 columns]

In [77]:
newdf.isnull()

         1      2      3
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
328  False  False  False
329  False  False  False
330  False  False  False
331  False  False  False
332  False  False  False

[333 rows x 3 columns]

In [78]:
newdf.dropna()

            1         2         3
0    0.413047  0.329586  0.619220
1    0.927830  0.688114  0.798926
2    0.665740  0.176250  0.737850
3    0.157335  0.735315  0.421148
4    0.460733  0.924275  0.825568
..        ...       ...       ...
328  0.804948  0.272622  0.811416
329  0.541297  0.675290  0.457969
330  0.321142  0.479422  0.086982
331  0.904591  0.775824  0.619668
332  0.804440  0.570352  0.866712

[333 rows x 3 columns]

In [79]:
newdf.drop_duplicates()

            1         2         3
0    0.413047  0.329586  0.619220
1    0.927830  0.688114  0.798926
2    0.665740  0.176250  0.737850
3    0.157335  0.735315  0.421148
4    0.460733  0.924275  0.825568
..        ...       ...       ...
328  0.804948  0.272622  0.811416
329  0.541297  0.675290  0.457969
330  0.321142  0.479422  0.086982
331  0.904591  0.775824  0.619668
332  0.804440  0.570352  0.866712

[333 rows x 3 columns]

In [80]:
newdf.notnull()

        1     2     3
0    True  True  True
1    True  True  True
2    True  True  True
3    True  True  True
4    True  True  True
..    ...   ...   ...
328  True  True  True
329  True  True  True
330  True  True  True
331  True  True  True
332  True  True  True

[333 rows x 3 columns]

In [81]:
newdf.max()

1    0.998050
2    0.994183
3    0.999374
dtype: float64

In [82]:
newdf.min()

1    0.002018
2    0.002484
3    0.007838
dtype: float64

In [83]:
newdf.std()

1    0.291121
2    0.283046
3    0.284313
dtype: float64

In [84]:
newdf.corr()

          1         2         3
1  1.000000 -0.059178  0.035909
2 -0.059178  1.000000  0.069047
3  0.035909  0.069047  1.000000

In [85]:
newdf.count()

1    333
2    333
3    333
dtype: int64

In [86]:
newdf.median()

1    0.483403
2    0.485398
3    0.546635
dtype: float64

In [87]:
newdf.count()

1    333
2    333
3    333
dtype: int64

In [88]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 333 entries, 0 to 332
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       333 non-null    float64
 1   2       333 non-null    float64
 2   3       333 non-null    float64
dtypes: float64(3)
memory usage: 18.5 KB

In [89]:
df

      name  RollNo  CTC  PTR  RTC  UFN
0  Mabtoor     235   34  542  545  432
1    Waqas     753   24  564  412  235
2   Horair     673   75  435  531  653
3   Waheed     732   34  756  653  123
4     Umer     796   65  445  234  455
5     Atif     357   45  665  152  632
6  Zeeshan     853   65  334  632  424
7     Zaka     257   74  653  645  635
8  Taqveem     975   63  563  765  673
9   Snawra     465   35  134  523  154

In [90]:
for df in pd.read_csv('infor.csv', chunksize=3):
    print('Chunk Size')
    print(df)

Chunk Size
   Unnamed: 0     name  RollNo  CTC  PTR  RTC  UFN
0           0  Mabtoor     235   34  542  545  432
1           1    Waqas     753   24  564  412  235
2           2   Horair     673   75  435  531  653
Chunk Size
   Unnamed: 0    name  RollNo  CTC  PTR  RTC  UFN
3           3  Waheed     732   34  756  653  123
4           4    Umer     796   65  445  234  455
5           5    Atif     357   45  665  152  632
Chunk Size
   Unnamed: 0     name  RollNo  CTC  PTR  RTC  UFN
6           6  Zeeshan     853   65  334  632  424
7           7     Zaka     257   74  653  645  635
8           8  Taqveem     975   63  563  765  673
Chunk Size
   Unnamed: 0    name  RollNo  CTC  PTR  RTC  UFN
9           9  Snawra     465   35  134  523  154

In [92]:
type(newdf[1])

pandas.core.series.Series

In [93]:
type(newdf[1][1])

numpy.float64

In [94]:
type(newdf)

pandas.core.frame.DataFrame

In [95]:
newdf.head(2)

          1         2         3
0  0.413047  0.329586  0.619220
1  0.927830  0.688114  0.798926

In [96]:
newdf.tail(2)

            1         2         3
331  0.904591  0.775824  0.619668
332  0.804440  0.570352  0.866712

In [97]:
newdf2= newdf

In [ ]:
newdf.loc[2][3]= 0,4